workspace/Catalogs/АукВидыАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукВидыАукционов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыОперацийАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукПродуктыАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СРаспределениемСуммы</Name>
					<Comment>Признак того, что при подведении итогов по аукциону данного вида будет использоваться распределение суммы аукциона</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоЗначенийСтруктурыСтавки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоЗначенийСтруктурыВводныхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромежуточныйИтогВариантВыбора</Name>
					<Comment>0 - Минимум, 1 - Максимум</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромежуточныйИтогФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромежуточныйИтогШаблонРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончательныйИтогФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончательныйИтогРаспределяемаяСуммаОсновная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончательныйИтогРаспределяемаяСуммаДополнительная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаРасчетаПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукНастройкиРасчетовИтогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаРасчетаОкончательныхИтогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукНастройкиРасчетовИтогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураСтавки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементСтавки</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОбязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураНачальныхДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПоУмолчанию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЧасы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/Enums/АукИсточникиЗначенийПеременных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукИсточникиЗначенийПеременных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараметрАукциона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредопределенныеДанные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/ChartsOfCharacteristicTypes/АукЭлементыДанныхАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>АукЭлементыДанныхАукционов</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.АукДопЭлементыДанныхАукционов</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>18</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехническоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЭлементПредопределенныхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЭлементДиапазона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЭлементаДиапазона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукВидыЭлементовДиапазонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарныйЭлементДиапазона</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

workspace/Catalogs/АукВидыАукционов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ОписаниеНастроекСтавокПоВидуАукциона(пВидАукциона) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукВидыАукционов.НесколькоЗначенийСтруктурыСтавки КАК НесколькоЗначенийСтруктурыСтавки
	|ИЗ
	|	Справочник.АукВидыАукционов КАК АукВидыАукционов
	|ГДЕ
	|	АукВидыАукционов.Ссылка = &ВидАукциона";
	
	Запрос.УстановитьПараметр("ВидАукциона", пВидАукциона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	
КонецФункции

Функция ОписаниеСтруктурыСтавкиПоВидуАукциона(пВидАукциона, пБулВТаблицуЗначений = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ВидыАукционовСтруктураСтавки.ЭлементСтавки КАК Элемент,
	|	Аук_ВидыАукционовСтруктураСтавки.НеОбязательный КАК НеОбязательный,
	|	АукЭлементыДанныхАукционов.Описание КАК Описание,
	|	АукЭлементыДанныхАукционов.ТехническоеНаименование КАК ТехническоеНаименование,
	|	АукЭлементыДанныхАукционов.ТипЗначения КАК ТипЗначения,
	|	АукЭлементыДанныхАукционов.Представление КАК ЭлементПредставление,
	|	АукЭлементыДанныхАукционов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.АукВидыАукционов.СтруктураСтавки КАК Аук_ВидыАукционовСтруктураСтавки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО Аук_ВидыАукционовСтруктураСтавки.ЭлементСтавки = АукЭлементыДанныхАукционов.Ссылка
	|ГДЕ
	|	Аук_ВидыАукционовСтруктураСтавки.Ссылка = &ВидАукциона
	|
	|УПОРЯДОЧИТЬ ПО
	|	Аук_ВидыАукционовСтруктураСтавки.НомерСтроки";
	
	Запрос.УстановитьПараметр("ВидАукциона", пВидАукциона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если пБулВТаблицуЗначений Тогда
		Возврат РезультатЗапроса.Выгрузить(); 	
	Иначе		
		Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	КонецЕсли;	
	
КонецФункции

Функция ОписаниеСтруктурыНачальныхДанныхПоВидуАукциона(пВидАукциона, пБулВТаблицуЗначений = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ВидыАукционовСтруктураНачальныхДанных.ЭлементДанных КАК Элемент,
	|	АукЭлементыДанныхАукционов.Описание КАК Описание,
	|	АукЭлементыДанныхАукционов.ТехническоеНаименование КАК ТехническоеНаименование,
	|	АукЭлементыДанныхАукционов.ТипЗначения КАК ТипЗначения,
	|	АукЭлементыДанныхАукционов.Представление КАК ЭлементПредставление,
	|	АукЭлементыДанныхАукционов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.АукВидыАукционов.СтруктураНачальныхДанных КАК Аук_ВидыАукционовСтруктураНачальныхДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО Аук_ВидыАукционовСтруктураНачальныхДанных.ЭлементДанных = АукЭлементыДанныхАукционов.Ссылка
	|ГДЕ
	|	Аук_ВидыАукционовСтруктураНачальныхДанных.Ссылка = &ВидАукциона";
	
	Запрос.УстановитьПараметр("ВидАукциона", пВидАукциона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если пБулВТаблицуЗначений Тогда
		Возврат РезультатЗапроса.Выгрузить(); 	
	Иначе		
		Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	КонецЕсли;
	
КонецФункции

Функция ОписаниеСтруктурыПараметровПоВидуАукциона(пВидАукциона, пБулВТаблицуЗначений = Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ВидыАукционовСтруктураПараметров.Параметр КАК Параметр,
	|	АукЭлементыДанныхАукционов.ТипЗначения КАК ТипЗначения,
	|	АукЭлементыДанныхАукционов.ТехническоеНаименование КАК ТехническоеНаименование
	|ИЗ
	|	Справочник.АукВидыАукционов.СтруктураПараметров КАК Аук_ВидыАукционовСтруктураПараметров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО Аук_ВидыАукционовСтруктураПараметров.Параметр = АукЭлементыДанныхАукционов.Ссылка
	|ГДЕ
	|	Аук_ВидыАукционовСтруктураПараметров.Ссылка = &ВидАукциона";
	
	Запрос.УстановитьПараметр("ВидАукциона", пВидАукциона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если пБулВТаблицуЗначений Тогда
		Возврат РезультатЗапроса.Выгрузить(); 	
	Иначе		
		Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	КонецЕсли;	
КонецФункции

Функция ОписаниеРасчетаПромежуточныхИтоговПоВидуАукциона(пВидАукциона) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукВидыАукционов.ПромежуточныйИтогВариантВыбора КАК ПромежуточныйИтогВариантВыбора,
	|	АукВидыАукционов.ПромежуточныйИтогФормула КАК ПромежуточныйИтогФормула,
	|	АукВидыАукционов.ПромежуточныйИтогШаблонРезультата КАК ПромежуточныйИтогШаблонРезультата
	|ИЗ
	|	Справочник.АукВидыАукционов КАК АукВидыАукционов
	|ГДЕ
	|	АукВидыАукционов.Ссылка = &ВидАукциона";
	
	Запрос.УстановитьПараметр("ВидАукциона", пВидАукциона);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	
КонецФункции	

Функция СписокЭтаповПоУмолчаниюПоВидуАукциона(пВидАукциона) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ВидыАукционовЭтапыПоУмолчанию.Этап КАК Этап,
	|	Аук_ВидыАукционовЭтапыПоУмолчанию.ДлительностьДни КАК ДлительностьДни,
	|	Аук_ВидыАукционовЭтапыПоУмолчанию.ДлительностьЧасы КАК ДлительностьЧасы
	|ИЗ
	|	Справочник.АукВидыАукционов.ЭтапыПоУмолчанию КАК Аук_ВидыАукционовЭтапыПоУмолчанию
	|ГДЕ
	|	Аук_ВидыАукционовЭтапыПоУмолчанию.Ссылка = &ВидАукциона";
	
	Запрос.УстановитьПараметр("ВидАукциона", пВидАукциона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	
КонецФункции	

// TODO
//
Функция КлючевыеДанныеВидаАукциона(пВидАукциона) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукВидыАукционов.ВидОперации КАК ВидОперации,
	|	АукВидыАукционов.Продукт КАК Продукт,
	|	АукВидыАукционов.СРаспределениемСуммы КАК СРаспределениемСуммы,
	|	(ВЫРАЗИТЬ(АукВидыАукционов.ПромежуточныйИтогФормула КАК СТРОКА(50))) <> """"
	|		И (ВЫРАЗИТЬ(АукВидыАукционов.ПромежуточныйИтогШаблонРезультата КАК СТРОКА(50))) <> """" КАК ЕстьДанныеДляРасчетаПромежуточногоИтога,
	|	АукВидыАукционов.НастройкаРасчетаПромежуточныхИтогов КАК НастройкаРасчетаПромежуточныхИтогов,
	|	АукВидыАукционов.НастройкаРасчетаОкончательныхИтогов КАК НастройкаРасчетаОкончательныхИтогов
	|ИЗ
	|	Справочник.АукВидыАукционов КАК АукВидыАукционов
	|ГДЕ
	|	АукВидыАукционов.Ссылка = &ВидАукциона";
	
	Запрос.УстановитьПараметр("ВидАукциона", пВидАукциона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	Иначе
		сткРез = Новый Структура;
		
		сткРез.Вставить("ВидОперации", Неопределено);
		сткРез.Вставить("Продукт", Неопределено);
		сткРез.Вставить("НастройкаРасчетаПромежуточныхИтогов", Неопределено);
		сткРез.Вставить("НастройкаРасчетаОкончательныхИтогов", Неопределено);
		сткРез.Вставить("СРаспределениемСуммы", Ложь);
		сткРез.Вставить("ЕстьДанныеДляРасчетаПромежуточногоИтога", Ложь);
		
		Возврат сткРез;
	КонецЕсли;	
	
КонецФункции	

Функция ОписаниеРасчетаОкончательныхИтоговПоВидуАукциона(пВидАукциона) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукВидыАукционов.ОкончательныйИтогФормула КАК Формула,
	|	АукВидыАукционов.ОкончательныйИтогРаспределяемаяСуммаОсновная КАК РаспределяемаяСуммаОсновная,
	|	АукВидыАукционов.ОкончательныйИтогРаспределяемаяСуммаДополнительная КАК РаспределяемаяСуммаДополнительная
	|ИЗ
	|	Справочник.АукВидыАукционов КАК АукВидыАукционов
	|ГДЕ
	|	АукВидыАукционов.Ссылка = &ВидАукциона";
	
	Запрос.УстановитьПараметр("ВидАукциона", пВидАукциона);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	
КонецФункции	

Функция ВидыАукционовСписком() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукВидыАукционов.Ссылка КАК ВидАукциона
	|ИЗ
	|	Справочник.АукВидыАукционов КАК АукВидыАукционов
	|ГДЕ
	|	НЕ АукВидыАукционов.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
КонецФункции	

Функция ОписаниеДанныхСвязанныхСАукциономПоВидуТолькоЗначения(пВидАукциона) Экспорт
	сооРезультат = Новый Соответствие;
	
	тзПараметрыАукциона = ОписаниеСтруктурыПараметровПоВидуАукциона(пВидАукциона, Истина);
		
	сооРезультат.Вставить(ПредопределенноеЗначение("Перечисление.АукИсточникиЗначенийПеременных.ПараметрАукциона"),
							АукОбщийКлиентСервер.КолонкаТаблицыВМассивСОтборомПоТипу(тзПараметрыАукциона, "Параметр", "ТипЗначения", Тип("Число")));
							
	тзСтруктураСтавки = ОписаниеСтруктурыСтавкиПоВидуАукциона(пВидАукциона, Истина);						
	
	сооРезультат.Вставить(ПредопределенноеЗначение("Перечисление.АукИсточникиЗначенийПеременных.Ставка"),
							АукОбщийКлиентСервер.КолонкаТаблицыВМассивСОтборомПоТипу(тзСтруктураСтавки, "Элемент", "ТипЗначения", Тип("Число")));
				
	тзНачальныеДанные = ОписаниеСтруктурыНачальныхДанныхПоВидуАукциона(пВидАукциона, Истина);						
							
	сооРезультат.Вставить(ПредопределенноеЗначение("Перечисление.АукИсточникиЗначенийПеременных.НачальныеДанные"),
							АукОбщийКлиентСервер.КолонкаТаблицыВМассивСОтборомПоТипу(тзНачальныеДанные, "Элемент", "ТипЗначения", Тип("Число")));
	
	Возврат сооРезультат;
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	

Функция ЗаменитьЭлементыНаТехническиеНаименования(пСтрокаДанных)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(пСтрокаДанных) Тогда
		
		// 1. Получить имена всех полей
		масРезультаты = СтрНайтиВсеПоРегулярномуВыражению(пСтрокаДанных, "(?<=\[).+(?=\])"); 
		
		Если масРезультаты.Количество() <> 0 Тогда
			
			масЭлементыФормулы = Новый Массив;
			
			Для Каждого ЭлРез Из масРезультаты Цикл
				
				масЭлементыФормулы.Добавить(ЭлРез.Значение);
				
			КонецЦикла;	
			
			// 2. Получить технические наименования по списку наименований
			сооРез = ПланыВидовХарактеристик.АукЭлементыДанныхАукционов.ЭлементыДанныхАукционовПоНаименованиям(масЭлементыФормулы);
			
			Если сооРез.Количество() <> 0 Тогда
				Результат = пСтрокаДанных;
				
				// 3. Заменить
				Для Каждого ЭлСоо Из сооРез Цикл
					
					Результат = СтрЗаменить(Результат, "[" + ЭлСоо.Ключ + "]", ЭлСоо.Значение.ТехническоеНаименование);	
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти
